In [1]:
import pandas as pd
import numpy as np

In [2]:
dict1 = {
    "name":["Devanshu","Divyank","Mubin","Riya","Krishita"],
    "marks":[99,98,97,96,95],
    "city":["Rajkot","Rajkot","Morbi","Rajkot","Rajkot"]
 }

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

       name  marks    city
0  Devanshu     99  Rajkot
1   Divyank     98  Rajkot
2     Mubin     97   Morbi
3      Riya     96  Rajkot
4  Krishita     95  Rajkot

In [6]:
df.to_csv("friends_index_false.csv",index=False)

In [7]:
df.head(2)

       name  marks    city
0  Devanshu     99  Rajkot
1   Divyank     98  Rajkot

In [8]:
df.tail(2)

       name  marks    city
3      Riya     96  Rajkot
4  Krishita     95  Rajkot

In [9]:
df.describe()

           marks
count   5.000000
mean   97.000000
std     1.581139
min    95.000000
25%    96.000000
50%    97.000000
75%    98.000000
max    99.000000

In [ ]:
i = 1 
while i < 6:
    if i == 3: 
        i = i+ 1
        break;